; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 10 parts and 100% wood
; Machines:
;   2 highspeed-saw
;   2 glazer
;   2 grinder
;   2 immersion-varnisher
;   2 planer
;   2 saw
;   2 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 highspeed-saw1 - highspeed-saw
    glazer0 glazer1 - glazer
    grinder0 grinder1 - grinder
    immersion-varnisher0 immersion-varnisher1 - immersion-varnisher
    planer0 planer1 - planer
    saw0 saw1 - saw
    spray-varnisher0 spray-varnisher1 - spray-varnisher
    blue mauve green white black red - acolour
    teak walnut - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - part
    b0 b1 b2 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 s11 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (boardsize-successor s9 s10)
    (boardsize-successor s10 s11)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (has-colour glazer0 green)
    (has-colour glazer1 black)
    (has-colour immersion-varnisher0 red)
    (has-colour immersion-varnisher0 green)
    (has-colour immersion-varnisher1 red)
    (has-colour immersion-varnisher1 green)
    (has-colour spray-varnisher0 red)
    (has-colour spray-varnisher0 green)
    (has-colour spray-varnisher1 red)
    (has-colour spray-varnisher1 green)
    (available p0)
    (treatment p0 varnished)
    (surface-condition p0 verysmooth)
    (wood p0 teak)
    (colour p0 red)
    (goalsize p0 small)
    (= (spray-varnish-cost p0) 5)
    (= (glaze-cost p0) 10)
    (= (grind-cost p0) 15)
    (= (plane-cost p0) 10)
    (unused p1)
    (goalsize p1 large)
    (= (spray-varnish-cost p1) 15)
    (= (glaze-cost p1) 20)
    (= (grind-cost p1) 45)
    (= (plane-cost p1) 30)
    (unused p2)
    (goalsize p2 medium)
    (= (spray-varnish-cost p2) 10)
    (= (glaze-cost p2) 15)
    (= (grind-cost p2) 30)
    (= (plane-cost p2) 20)
    (unused p3)
    (goalsize p3 medium)
    (= (spray-varnish-cost p3) 10)
    (= (glaze-cost p3) 15)
    (= (grind-cost p3) 30)
    (= (plane-cost p3) 20)
    (available p4)
    (treatment p4 colourfragments)
    (surface-condition p4 rough)
    (wood p4 walnut)
    (colour p4 natural)
    (goalsize p4 medium)
    (= (spray-varnish-cost p4) 10)
    (= (glaze-cost p4) 15)
    (= (grind-cost p4) 30)
    (= (plane-cost p4) 20)
    (unused p5)
    (goalsize p5 large)
    (= (spray-varnish-cost p5) 15)
    (= (glaze-cost p5) 20)
    (= (grind-cost p5) 45)
    (= (plane-cost p5) 30)
    (available p6)
    (treatment p6 colourfragments)
    (surface-condition p6 verysmooth)
    (wood p6 walnut)
    (colour p6 natural)
    (goalsize p6 medium)
    (= (spray-varnish-cost p6) 10)
    (= (glaze-cost p6) 15)
    (= (grind-cost p6) 30)
    (= (plane-cost p6) 20)
    (unused p7)
    (goalsize p7 large)
    (= (spray-varnish-cost p7) 15)
    (= (glaze-cost p7) 20)
    (= (grind-cost p7) 45)
    (= (plane-cost p7) 30)
    (unused p8)
    (goalsize p8 large)
    (= (spray-varnish-cost p8) 15)
    (= (glaze-cost p8) 20)
    (= (grind-cost p8) 45)
    (= (plane-cost p8) 30)
    (unused p9)
    (goalsize p9 medium)
    (= (spray-varnish-cost p9) 10)
    (= (glaze-cost p9) 15)
    (= (grind-cost p9) 30)
    (= (plane-cost p9) 20)
    (boardsize b0 s5)
    (wood b0 walnut)
    (surface-condition b0 smooth)
    (available b0)
    (boardsize b1 s11)
    (wood b1 teak)
    (surface-condition b1 rough)
    (available b1)
    (boardsize b2 s2)
    (wood b2 teak)
    (surface-condition b2 rough)
    (available b2)
  )
  (:goal
    (and
    (available p0)
    (treatment p0 varnished)
    (surface-condition p0 verysmooth)
    (colour p0 green)
    (wood p0 teak)
    (available p1)
    (surface-condition p1 verysmooth)
    (wood p1 walnut)
    (available p2)
    (surface-condition p2 smooth)
    (wood p2 walnut)
    (available p3)
    (treatment p3 glazed)
    (wood p3 teak)
    (available p4)
    (treatment p4 varnished)
    (wood p4 walnut)
    (available p5)
    (treatment p5 varnished)
    (wood p5 teak)
    (surface-condition p5 smooth)
    (available p6)
    (wood p6 walnut)
    (surface-condition p6 smooth)
    (available p7)
    (surface-condition p7 smooth)
    (wood p7 teak)
    (available p8)
    (treatment p8 varnished)
    (colour p8 red)
    (wood p8 teak)
    (available p9)
    (colour p9 red)
    (treatment p9 varnished)
    (surface-condition p9 verysmooth)
    (wood p9 teak)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-medium b2 p9 saw0 teak rough s2 s1 s0)
   deleted: (unused p9)
   added: (available p9) (wood p9 teak) (surface-condition p9 rough) (colour p9 natural) (treatment p9 untreated) (boardsize b2 s0)
   goals met: 10 of 36
2. (do-saw-medium b1 p3 saw0 teak rough s11 s10 s9)
   deleted: (unused p3)
   added: (available p3) (wood p3 teak) (surface-condition p3 rough) (colour p3 natural) (treatment p3 untreated) (boardsize b1 s9)
   goals met: 12 of 36
3. (do-saw-large b0 p1 saw0 walnut smooth s5 s3 s4 s2)
   deleted: (unused p1)
   added: (available p1) (wood p1 walnut) (surface-condition p1 smooth) (colour p1 natural) (treatment p1 untreated) (boardsize b0 s2)
   goals met: 14 of 36
4. (do-plane p9 planer0 rough natural untreated)
   deleted: (surface-condition p9 rough)
   added: (surface-condition p9 smooth)
   goals met: 14 of 36
5. (do-plane p6 planer0 verysmooth natural colourfragments)
   deleted: (surface-condition p6 verysmooth) (treatment p6 colourfragments)
   added: (surface-condition p6 smooth) (treatment p6 untreated)
   goals met: 15 of 36
6. (do-plane p4 planer0 rough natural colourfragments)
   deleted: (surface-condition p4 rough) (treatment p4 colourfragments)
   added: (surface-condition p4 smooth) (treatment p4 untreated)
   goals met: 15 of 36
7. (do-plane p0 planer0 verysmooth red varnished)
   deleted: (surface-condition p0 verysmooth) (treatment p0 varnished) (colour p0 red)
   added: (surface-condition p0 smooth) (treatment p0 untreated) (colour p0 natural)
   goals met: 13 of 36
8. (do-immersion-varnish p4 immersion-varnisher0 green smooth)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 varnished) (colour p4 green)
   goals met: 14 of 36
9. (do-grind p9 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p9 smooth)
   added: (surface-condition p9 verysmooth)
   goals met: 15 of 36
10. (do-grind p1 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p1 smooth)
   added: (surface-condition p1 verysmooth)
   goals met: 16 of 36
11. (do-grind p0 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p0 smooth)
   added: (surface-condition p0 verysmooth)
   goals met: 17 of 36
12. (do-glaze p3 glazer0 green)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 glazed) (colour p3 green)
   goals met: 18 of 36
13. (do-immersion-varnish p0 immersion-varnisher0 green verysmooth)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 varnished) (colour p0 green)
   goals met: 20 of 36
14. (do-immersion-varnish p9 immersion-varnisher0 red verysmooth)
   deleted: (treatment p9 untreated) (colour p9 natural)
   added: (treatment p9 varnished) (colour p9 red)
   goals met: 22 of 36
15. (do-saw-large b1 p5 saw0 teak rough s9 s7 s8 s6)
   deleted: (unused p5)
   added: (available p5) (wood p5 teak) (surface-condition p5 rough) (colour p5 natural) (treatment p5 untreated) (boardsize b1 s6)
   goals met: 24 of 36
16. (do-plane p5 planer0 rough natural untreated)
   deleted: (surface-condition p5 rough)
   added: (surface-condition p5 smooth)
   goals met: 25 of 36
17. (do-immersion-varnish p5 immersion-varnisher0 green smooth)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 varnished) (colour p5 green)
   goals met: 26 of 36
18. (do-saw-large b1 p7 saw0 teak rough s6 s4 s5 s3)
   deleted: (unused p7)
   added: (available p7) (wood p7 teak) (surface-condition p7 rough) (colour p7 natural) (treatment p7 untreated) (boardsize b1 s3)
   goals met: 28 of 36
19. (do-plane p7 planer0 rough natural untreated)
   deleted: (surface-condition p7 rough)
   added: (surface-condition p7 smooth)
   goals met: 29 of 36
20. (do-saw-large b1 p8 saw0 teak rough s3 s1 s2 s0)
   deleted: (unused p8)
   added: (available p8) (wood p8 teak) (surface-condition p8 rough) (colour p8 natural) (treatment p8 untreated) (boardsize b1 s0)
   goals met: 31 of 36
21. (do-plane p8 planer0 rough natural untreated)
   deleted: (surface-condition p8 rough)
   added: (surface-condition p8 smooth)
   goals met: 31 of 36
22. (do-immersion-varnish p8 immersion-varnisher0 red smooth)
   deleted: (treatment p8 untreated) (colour p8 natural)
   added: (treatment p8 varnished) (colour p8 red)
   goals met: 33 of 36
23. (do-saw-medium b0 p2 saw0 walnut smooth s2 s1 s0)
   deleted: (unused p2)
   added: (available p2) (wood p2 walnut) (surface-condition p2 smooth) (colour p2 natural) (treatment p2 untreated) (boardsize b0 s0)
   goals met: 36 of 36
